{
  "What is sorting?": "Sorting is the process of arranging data in ascending or descending order.",
  "Why is sorting important?": "It helps organize data and makes searching and analysis easier.",
  "Name some common sorting algorithms.": "Bubble Sort, Selection Sort, Insertion Sort, Merge Sort, Quick Sort.",
  "What is the difference between internal and external sorting?": "Internal sorting happens in main memory, while external sorting is done using external storage like files.",
  "Explain Bubble Sort.": "It compares adjacent elements and swaps them if they are in the wrong order until the list is sorted.",
  "What is the time complexity of Bubble Sort?": "Best: O(n), Worst/Average: O(n²).",
  "Explain Selection Sort.": "It repeatedly finds the smallest element and places it at the beginning of the unsorted portion.",
  "Difference between Bubble Sort and Selection Sort.": "Bubble Sort swaps adjacent elements; Selection Sort finds the minimum element each pass.",
  "Explain Insertion Sort.": "It builds a sorted list one element at a time by inserting each element into its correct position.",
  "Advantage of Insertion Sort.": "It works efficiently for small or nearly sorted datasets.",
  "Explain Merge Sort.": "It divides the array into halves, recursively sorts them, and merges them together.",
  "Time complexity of Merge Sort.": "O(n log n) in all cases.",
  "Advantages of Merge Sort.": "Efficient for large datasets and is stable.",
  "Disadvantages of Merge Sort.": "Requires extra space for merging (O(n) space).",
  "Explain Quick Sort.": "It selects a pivot, partitions elements around it, and recursively sorts the sublists.",
  "Time complexity of Quick Sort.": "Best/Average: O(n log n), Worst: O(n²).",
  "Which is faster, Merge Sort or Quick Sort?": "Quick Sort is usually faster due to better cache performance.",
  "Which sorting algorithms are stable?": "Bubble Sort, Insertion Sort, and Merge Sort.",
  "What is a stable sort?": "A stable sort keeps the relative order of elements with equal values.",
  "Which algorithms use divide and conquer?": "Merge Sort and Quick Sort.",
  "Which sorting is best for small datasets?": "Insertion Sort or Bubble Sort.",
  "Which sorting is best for large datasets?": "Merge Sort or Quick Sort.",
  "Can strings be sorted?": "Yes, because strings can be compared lexicographically.",
  "Difference between in-place and out-of-place sorting.": "In-place uses constant memory; out-of-place uses extra space.",
  "What sorting algorithm does Python use?": "Python uses Timsort, a hybrid of Merge and Insertion Sort (O(n log n)).",
  
  "What is Object-Oriented Programming (OOP)?": "OOP organizes code using objects and classes that model real-world entities.",
  "What is a class?": "A class is a blueprint for creating objects.",
  "What is an object?": "An object is an instance of a class containing data and behavior.",
  "Difference between class and object.": "Class is a design; object is its implementation.",
  "What is __init__ method?": "It is a constructor used to initialize object attributes.",
  "What is self in Python classes?": "It refers to the current object of the class.",
  "What is encapsulation?": "It means hiding data and allowing controlled access through methods.",
  "What is inheritance?": "It allows one class to use properties and methods of another class.",
  "What is polymorphism?": "It allows methods with the same name to behave differently in different classes.",
  "What is method overriding?": "When a child class defines a method with the same name as its parent’s method.",
  "What is abstraction?": "It hides complex implementation details and shows only essential features.",
  "What are the four pillars of OOP?": "Encapsulation, Inheritance, Polymorphism, and Abstraction.",
  "What is a constructor in Python?": "A special method (__init__) that initializes data when an object is created.",
  "What is a destructor in Python?": "A special method (__del__) called when an object is deleted.",
  "What are instance and class variables?": "Instance variables belong to each object; class variables are shared across all objects.",
  "What is multiple inheritance?": "When a class inherits from more than one parent class.",
  "What is hierarchical inheritance?": "When multiple child classes inherit from one parent class.",
  "What is hybrid inheritance?": "A combination of two or more types of inheritance.",
  "What is data hiding?": "Making variables private using double underscores (__).",
  "Difference between overloading and overriding.": "Overloading changes parameters (not directly supported in Python); overriding redefines parent methods.",
  "Purpose of super() keyword.": "Used to call a parent class constructor or method from a child class.",
  "What are getters and setters?": "Methods to access (get) or modify (set) private data members.",
  "What is __str__ method?": "It defines how an object should be represented as a string.",
  "Can Python have multiple constructors?": "No, but we can simulate them using default arguments.",
  "Difference between procedural and OOP.": "Procedural focuses on functions; OOP focuses on objects and classes.",
  "Why use OOP?": "It improves code reusability, modularity, and readability.",
  "What is an abstract class?": "A class that cannot be instantiated and provides a base for other classes.",
  "Example of OOP in real life.": "A Car class with attributes like color and methods like start() and stop().",
  "What is composition?": "When a class contains objects of another class as members.",
  "Difference between @staticmethod and @classmethod.": "@staticmethod doesn’t use class or instance; @classmethod uses class reference.",
  
  "How can we use OOP in sorting?": "By creating a Sorting class with methods for different sorting algorithms.",
  "Can sorting algorithms be polymorphic?": "Yes, each sorting algorithm can override a common sort() method.",
  "Give an example where OOP and sorting work together.": "Sorting a list of Student objects based on marks using Bubble Sort in a class method.",
  "Why is encapsulation useful in sorting programs?": "It hides the sorting logic and makes the code reusable and organized.",
  "What are real-life uses of sorting algorithms?": "Used in ranking systems, search engines, and organizing large datasets."
}
